Revit 2026 API

# CircuitConnectionType Enumeration

---

An enumerated type indicates the panel to panel connection type

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum CircuitConnectionType
```
```vb
Public Enumeration CircuitConnectionType
```
```cpp
public enum class CircuitConnectionType
```
```fsharp
type CircuitConnectionType
```

| Member name | Value | Description |
| --- | --- | --- |
| Breaker | 1 | Breaker. |
| FeedThruLugs | 2 | FeedThruLugs. |
| NotApplicable | 0 | NotApplicable. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace